export const g4Resources = [
  // Add g4 books here.
  // Example:
  {
    id: 1001,
    title: 'គោលនយោបាយស្តីពី ការផ្តល់សេវាសាធារណៈ (២០០៦)',
    category: 'g4',
    type: 'PDF',
    size: '2.17 MB',
    date: '2006',
    description: 'ឯកសារនេះគឺជាគោលនយោបាយរបស់រាជរដ្ឋាភិបាលកម្ពុជាដែលផ្តោតលើការពង្រឹងគុណភាព តម្លាភាព និងប្រសិទ្ធភាពនៃការផ្តល់សេវាសាធារណៈ ក្នុងគោលដៅបម្រើប្រជាពលរដ្ឋឱ្យបានកាន់តែល្អប្រសើរឡើង។',
    image: '/books_cover/4/book1.jpg',
    file: '/books_pdf/4/book1.pdf'
  },
  {
    id: 1002,
    title: 'ច្បាប់ស្តីពីការរៀបចំ និងការប្រព្រឹត្តទៅនៃក្រុមប្រឹក្សារាជសម្បត្តិ (២០០៤)',
    category: 'g4',
    type: 'PDF',
    size: '342.39 MB',
    date: '2004',
    description: 'ច្បាប់នេះកំណត់អំពីយន្តការ សមាសភាព តួនាទី និងនីតិវិធីរបស់ក្រុមប្រឹក្សារាជសម្បត្តិ ក្នុងការជ្រើសតាំងព្រះមហាក្សត្រថ្មីនៃព្រះរាជាណាចក្រកម្ពុជា ដើម្បីធានានូវនិរន្តរភាពនៃរាជបល្ល័ង្ក និងស្ថាប័នព្រះមហាក្សត្រ។',
    image: '/books_cover/4/book2.jpg',
    file: '/books_pdf/4/book2.pdf'
  },
  {
    id: 1003,
    title: 'ច្បាប់ស្តីពីលក្ខន្តិកៈសមាជិកព្រឹទ្ធសភា (២០០៨)',
    category: 'g4',
    type: 'PDF',
    size: '6.39 MB',
    date: '2008',
    description: 'ឯកសារនេះគឺជាច្បាប់ដែលកំណត់អំពីសិទ្ធិ អភ័យឯកសិទ្ធិ តួនាទី ភារកិច្ច និងលក្ខខណ្ឌការងាររបស់សមាជិកព្រឹទ្ធសភានៃព្រះរាជាណាចក្រកម្ពុជា ដើម្បីធានាដល់ការបំពេញមុខងារនីតិប្បញ្ញត្តិប្រកបដោយប្រសិទ្ធភាព និងការទទួលខុសត្រូវខ្ពស់។',
    image: '/books_cover/4/book3.jpg',
    file: '/books_pdf/4/book3.pdf'
  },
  {
    id: 1004,
    title: 'ច្បាប់ស្តីពីលក្ខន្តិកៈនៃចៅក្រម និងព្រះរាជអាជ្ញា (២០១៤)',
    category: 'g4',
    type: 'PDF',
    size: '1.53 MB',
    date: '2014',
    description: 'ឯកសារនេះគឺជាច្បាប់ដែលកំណត់អំពីសិទ្ធិ កាតព្វកិច្ច ក្រមសីលធម៌ ព្រមទាំងនីតិវិធីនៃការតែងតាំង និងគ្រប់គ្រងចៅក្រមនិងព្រះរាជអាជ្ញា ក្នុងគោលបំណងធានាដល់ឯករាជ្យភាព សុចរិតភាព និងប្រសិទ្ធភាពនៃប្រព័ន្ធយុត្តិធម៌នៅកម្ពុជា។',
    image: '/books_cover/4/book4.jpg',
    file: '/books_pdf/4/book4.pdf'
  },
  {
    id: 1005,
    title: 'ច្បាប់ស្តីពីការបោះឆ្នោតជ្រើសតាំងសមាជិកព្រឹទ្ធសភា (២០១៧)',
    category: 'g4',
    type: 'PDF',
    size: '2.17 MB',
    date: '2017',
    description: 'ឯកសារនេះគឺជាច្បាប់ដែលចែងអំពីគោលការណ៍ នីតិវិធី និងបទប្បញ្ញត្តិពាក់ព័ន្ធនឹងដំណើរការបោះឆ្នោតជ្រើសតាំងសមាជិកព្រឹទ្ធសភានៅកម្ពុជា ដើម្បីធានាឱ្យការបោះឆ្នោតប្រព្រឹត្តទៅដោយសេរី ត្រឹមត្រូវ និងយុត្តិធម៌។',
    image: '/books_cover/4/book5.jpg',
    file: '/books_pdf/4/book5.pdf'
  },
  {
    id: 1006,
    title: 'កម្មវិធីជាតិកំណែទម្រង់រដ្ឋបាលសាធារណៈ ២០១៥-២០១៨ (២០១៥)',
    category: 'g4',
    type: 'PDF',
    size: '6.41 MB',
    date: '2015',
    description: 'ឯកសារនេះគឺជាផែនការយុទ្ធសាស្ត្រថ្នាក់ជាតិសម្រាប់រយៈពេល ៤ឆ្នាំ (២០១៥-២០១៨) ដែលផ្តោតលើការធ្វើទំនើបកម្ម និងការពង្រឹងប្រសិទ្ធភាពស្ថាប័នរដ្ឋបាលសាធារណៈ សំដៅលើកកម្ពស់គុណភាព តម្លាភាព និងគណនេយ្យភាពនៃការផ្តល់សេវាជូនប្រជាពលរដ្ឋឱ្យកាន់តែប្រសើរឡើង។',
    image: '/books_cover/4/book6.jpg',
    file: '/books_pdf/4/book6.pdf'
  },
  {
    id: 1007,
    title: 'កម្មវិធីជាតិកំណែទម្រង់រដ្ឋបាលសាធារណៈ ២០១៥-២០៣០ (សេចក្តីព្រាងលើកទី១ ឆ្នាំ២០១៥)',
    category: 'g4',
    type: 'PDF',
    size: '14.05 MB',
    date: '2015',
    description: 'ឯកសារសេចក្តីព្រាងនេះគឺជាផែនការយុទ្ធសាស្ត្រថ្នាក់ជាតិរយៈពេលវែង ដែលកំណត់អំពីចក្ខុវិស័យ និងទិសដៅសម្រាប់ធ្វើទំនើបកម្មស្ថាប័នរដ្ឋបាលសាធារណៈកម្ពុជា សំដៅពង្រឹងសមត្ថភាពមន្ត្រីរាជការ និងប្រសិទ្ធភាពនៃការផ្តល់សេវាសាធារណៈប្រកបដោយចីរភាព។',
    image: '/books_cover/4/book7.jpg',
    file: '/books_pdf/4/book7.pdf'
  },
  {
    id: 1008,
    title: 'ក្របខណ្ឌគោលនយោបាយសេដ្ឋកិច្ច និងសង្គមឌីជីថលកម្ពុជា ២០២១-២០៣៥ (២០២១)',
    category: 'g4',
    type: 'PDF',
    size: '6.17 MB',
    date: '2021',
    description: 'ឯកសារនេះជាផែនទីបង្ហាញផ្លូវយុទ្ធសាស្ត្ររយៈពេលវែងរបស់រាជរដ្ឋាភិបាលកម្ពុជា ក្នុងការកសាងមូលដ្ឋានគ្រឹះសេដ្ឋកិច្ច និងសង្គមឌីជីថល ដើម្បីជំរុញកំណើនសេដ្ឋកិច្ចថ្មី និងលើកកម្ពស់ប្រសិទ្ធភាពនៃការរស់នៅ ការធ្វើធុរកិច្ច និងការផ្តល់សេវាសាធារណៈ។',
    image: '/books_cover/4/book8.jpg',
    file: '/books_pdf/4/book8.pdf'
  },
  {
    id: 1009,
    title: 'ក្របខ័ណ្ឌគោលដៅអភិវឌ្ឍប្រកបដោយចីរភាពកម្ពុជា ឆ្នាំ២០១៦-២០៣០ (២០១៨)',
    category: 'g4',
    type: 'PDF',
    size: '16.12 MB',
    date: '2018',
    description: 'ឯកសារនេះជាក្របខ័ណ្ឌយុទ្ធសាស្ត្រថ្នាក់ជាតិដែលកំណត់អំពីគោលដៅ និងសូចនាករសម្រាប់ការអភិវឌ្ឍសេដ្ឋកិច្ច សង្គម និងបរិស្ថាននៅកម្ពុជា សំដៅធានានូវកំណើនប្រកបដោយបរិយាបន្ន និងចីរភាព ស្របតាមរបៀបវារៈសកលឆ្នាំ២០៣០។',
    image: '/books_cover/4/book9.jpg',
    file: '/books_pdf/4/book9.pdf'
  },
  {
    id: 1010,
    title: 'វេទិការវាងរាជរដ្ឋាភិបាល និងរដ្ឋបាលថ្នាក់ក្រោមជាតិ ស្តីពី “កំណែទម្រង់វិមជ្ឈការ និងវិសហមជ្ឈការ ដើម្បីចូលរួមសម្រេចបានចក្ខុវិស័យកម្ពុជាឆ្នាំ២០៥០” (២០២៤)',
    category: 'g4',
    type: 'PDF',
    size: '38.06 MB',
    date: '2024',
    description: 'ឯកសារនេះផ្តោតលើកិច្ចពិភាក្សា និងការតម្រង់ទិសយុទ្ធសាស្ត្រសម្រាប់ការអនុវត្តកំណែទម្រង់វិមជ្ឈការ និងវិសហមជ្ឈការនៅថ្នាក់ក្រោមជាតិ ដើម្បីពង្រឹងប្រសិទ្ធភាពការគ្រប់គ្រងរដ្ឋបាល សេវាសាធារណៈ និងជំរុញការអភិវឌ្ឍមូលដ្ឋាន ឆ្ពោះទៅសម្រេចចក្ខុវិស័យកម្ពុជាឆ្នាំ២០៥០។',
    image: '/books_cover/4/book10.jpg',
    file: '/books_pdf/4/book10.pdf'
  },
  {
    id: 1011,
    title: 'គោលនយោបាយរដ្ឋាភិបាលឌីជីថលកម្ពុជា ២០២២-២០៣៥ (២០២២)',
    category: 'g4',
    type: 'PDF',
    size: '4.08 MB',
    date: '2022',
    description: 'ឯកសារនេះជាផែនទីបង្ហាញផ្លូវយុទ្ធសាស្ត្រក្នុងការកសាង និងធ្វើទំនើបកម្មរដ្ឋាភិបាលឌីជីថលកម្ពុជា សំដៅលើកកម្ពស់ប្រសិទ្ធភាព តម្លាភាព និងគុណភាពនៃការផ្តល់សេវាសាធារណៈជូនប្រជាពលរដ្ឋ និងធុរជន តាមរយៈការប្រើប្រាស់បច្ចេកវិទ្យា។',
    image: '/books_cover/4/book11.jpg',
    file: '/books_pdf/4/book11.pdf'
  },
  {
    id: 1012,
    title: 'ច្បាប់ស្តីពីការគ្រប់គ្រងរដ្ឋបាល រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ (២០០៨)',
    category: 'g4',
    type: 'PDF',
    size: '9.05 MB',
    date: '2008',
    description: 'ឯកសារនេះគឺជាច្បាប់គោលដែលកំណត់អំពីការរៀបចំរចនាសម្ព័ន្ធ តួនាទី ភារកិច្ច និងសិទ្ធិអំណាចរបស់រដ្ឋបាលថ្នាក់ក្រោមជាតិ ដើម្បីជំរុញការអនុវត្តគោលនយោបាយវិមជ្ឈការ និងវិសហមជ្ឈការ ព្រមទាំងការអភិវឌ្ឍតាមមូលដ្ឋាននៅកម្ពុជា។',
    image: '/books_cover/4/book12.jpg',
    file: '/books_pdf/4/book12.pdf'
  },
  {
    id: 1013,
    title: 'ច្បាប់ស្តីពីលទ្ធកម្មសាធារណៈ (២០២៣)',
    category: 'g4',
    type: 'PDF',
    size: '20.16 MB',
    date: '2023',
    description: 'ឯកសារនេះគឺជាច្បាប់ដែលកំណត់អំពីគោលការណ៍ វិធាន និងនីតិវិធីនៃការអនុវត្តលទ្ធកម្មសាធារណៈនៅកម្ពុជា ដើម្បីធានាឱ្យមានតម្លាភាព គណនេយ្យភាព ភាពប្រកួតប្រជែងដោយស្មើភាព និងប្រសិទ្ធភាពខ្ពស់ក្នុងការគ្រប់គ្រង និងប្រើប្រាស់ថវិកាជាតិ។',
    image: '/books_cover/4/book13.jpg',
    file: '/books_pdf/4/book13.pdf'
  },
  {
    id: 1014,
    title: 'ច្បាប់ស្តីពីការគ្រប់គ្រងរដ្ឋបាល ឃុំ សង្កាត់ (២០០១)',
    category: 'g4',
    type: 'PDF',
    size: '3.12 MB',
    date: '2001',
    description: 'ឯកសារនេះគឺជាច្បាប់គោលដែលកំណត់អំពីការរៀបចំរចនាសម្ព័ន្ធ តួនាទី ភារកិច្ច និងសិទ្ធិអំណាចរបស់រដ្ឋបាលឃុំ-សង្កាត់ សំដៅជំរុញដំណើរការវិមជ្ឈការ ព្រមទាំងការអភិវឌ្ឍសេដ្ឋកិច្ច និងសង្គមនៅតាមមូលដ្ឋាន។',
    image: '/books_cover/4/book14.jpg',
    file: '/books_pdf/4/book14.pdf'
  },
  {
    id: 1015,
    title: 'ច្បាប់ស្តីពីការប្រឆាំងនឹងអំពើពុករលួយ (២០១០)',
    category: 'g4',
    type: 'PDF',
    size: '2.41 MB',
    date: '2010',
    description: 'ឯកសារនេះគឺជាច្បាប់ដែលបង្កើតឡើងក្នុងគោលបំណងទប់ស្កាត់ លុបបំបាត់ និងបង្ក្រាបអំពើពុករលួយគ្រប់ទម្រង់ ដើម្បីលើកកម្ពស់តម្លាភាព គណនេយ្យភាព អភិបាលកិច្ចល្អ និងនីតិរដ្ឋនៅក្នុងព្រះរាជាណាចក្រកម្ពុជា។',
    image: '/books_cover/4/book15.jpg',
    file: '/books_pdf/4/book15.pdf'
  },
  {
    id: 1016,
    title: 'ច្បាប់ស្តីពីការរៀបចំ និងការប្រព្រឹត្តទៅនៃគណៈរដ្ឋមន្ត្រី (១៩៩៤)',
    category: 'g4',
    type: 'PDF',
    size: '1.09 MB',
    date: '1994',
    description: 'ឯកសារនេះគឺជាច្បាប់ដែលកំណត់អំពីការរៀបចំ រចនាសម្ព័ន្ធ តួនាទី ភារកិច្ច និងនីតិវិធីនៃការប្រព្រឹត្តទៅរបស់គណៈរដ្ឋមន្ត្រី ដែលជាស្ថាប័ននីតិប្រតិបត្តិកំពូលនៃព្រះរាជាណាចក្រកម្ពុជា ដើម្បីធានាដល់ការដឹកនាំ និងការគ្រប់គ្រងរដ្ឋប្រកបដោយប្រសិទ្ធភាព។',
    image: '/books_cover/4/book16.jpg',
    file: '/books_pdf/4/book16.pdf'
  },
  {
    id: 1017,
    title: 'ច្បាប់ស្តីពីប្រព័ន្ធហិរញ្ញវត្ថុសាធារណៈ (២០២៣)',
    category: 'g4',
    type: 'PDF',
    size: '21.68 MB',
    date: '2023',
    description: 'ឯកសារនេះគឺជាច្បាប់គោលដែលកំណត់អំពីក្របខ័ណ្ឌ គោលការណ៍ និងនីតិវិធីនៃការគ្រប់គ្រងប្រព័ន្ធហិរញ្ញវត្ថុសាធារណៈនៅកម្ពុជា រួមមានការរៀបចំ ការអនុវត្ត និងការត្រួតពិនិត្យថវិកាជាតិ ដើម្បីធានាឱ្យមានតម្លាភាព គណនេយ្យភាព និងប្រសិទ្ធភាពខ្ពស់ក្នុងការប្រើប្រាស់ធនធានរបស់រដ្ឋ។',
    image: '/books_cover/4/book17.jpg',
    file: '/books_pdf/4/book17.pdf'
  },
  {
    id: 1018,
    title: 'ច្បាប់ស្តីពីសហលក្ខន្តិកៈមន្ត្រីរាជការស៊ីវិល នៃព្រះរាជាណាចក្រកម្ពុជា (១៩៩៤)',
    category: 'g4',
    type: 'PDF',
    size: '745 kB',
    date: '1994',
    description: 'ឯកសារនេះគឺជាច្បាប់គោលដែលកំណត់អំពីក្របខ័ណ្ឌគតិយុត្ត សិទ្ធិ កាតព្វកិច្ច ការជ្រើសរើស របបបៀវត្ស និងលក្ខខណ្ឌការងារទូទៅរបស់មន្ត្រីរាជការស៊ីវិលនៅកម្ពុជា ដើម្បីធានាឱ្យការបំពេញមុខងារសាធារណៈប្រព្រឹត្តទៅប្រកបដោយប្រសិទ្ធភាព តម្លាភាព និងវិជ្ជាជីវៈខ្ពស់។',
    image: '/books_cover/4/book18.jpg',
    file: '/books_pdf/4/book18.pdf'
  },
  {
    id: 1019,
    title: 'និយាមនីតិវិធីប្រតិបត្តិ សម្រាប់ ការប្រឡងប្រជែងជ្រើសរើសមន្ត្រីរាជការស៊ីវិល (២០២៤)',
    category: 'g4',
    type: 'PDF',
    size: '3.9 MB',
    date: '2024',
    description: 'ឯកសារនេះគឺជាគោលការណ៍ និងនីតិវិធីស្តង់ដារដែលត្រូវបានដាក់ឱ្យអនុវត្ត ដើម្បីធានាឱ្យដំណើរការនៃការប្រឡងប្រជែងជ្រើសរើសមន្ត្រីរាជការស៊ីវិលប្រព្រឹត្តទៅប្រកបដោយគុណាធិបតេយ្យ តម្លាភាព យុត្តិធម៌ បរិយាបន្ន និងប្រសិទ្ធភាពខ្ពស់ ស្របតាមទិសដៅកែទម្រង់រដ្ឋបាលសាធារណៈរបស់រាជរដ្ឋាភិបាល។',
    image: '/books_cover/4/book19.jpg',
    file: '/books_pdf/4/book19.pdf'
  },
  {
    id: 1020,
    title: 'ផែនការយុទ្ធសាស្ត្រអភិវឌ្ឍន៍ជាតិ ២០១៩-២០២៣ (២០១៩)',
    category: 'g4',
    type: 'PDF',
    size: '16.69 MB',
    date: '2019',
    description: 'ឯកសារនេះគឺជាផែនការមេរបស់រាជរដ្ឋាភិបាលសម្រាប់រយៈពេល ៥ឆ្នាំ ដែលកំណត់អំពីទិសដៅ គោលនយោបាយ និងអាទិភាពអភិវឌ្ឍន៍សង្គម-សេដ្ឋកិច្ច សំដៅជំរុញកំណើន បង្កើតការងារ ធានាសមធម៌ និងប្រសិទ្ធភាព ឆ្ពោះទៅសម្រេចចក្ខុវិស័យកម្ពុជាជាប្រទេសចំណូលមធ្យមកម្រិតខ្ពស់នៅឆ្នាំ២០៣០។',
    image: '/books_cover/4/book20.jpg',
    file: '/books_pdf/4/book20.pdf'
  }
];

export const g5Resources = [
  // Add g5 books here.
  // Example:
  // {
  //   id: 2001,
  //   title: 'Past exam paper',
  //   category: 'g5',
  //   type: 'PDF',
  //   size: '1.1 MB',
  //   date: '2025',
  //   description: 'Short description',
  //   image: '/books_cover/5/book1.jpg',
  //   file: '/books_pdf/5/book1.pdf'
  // }
];

export const sourceG4G5Resources = [...g4Resources, ...g5Resources];
